app/controllers/loans_controller.rb

INSERT INTO "loans" ("amount", "enddate", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 500.0], ["enddate", "2016-06-21"], ["user_id", 1], ["created_at", "2016-06-16 17:06:19.784278"], ["updated_at", "2016-06-16 17:06:19.784278"]]
---
  def create

    @loan = current_user.loans.new(loan_params)

    respond_to do |format|
      if @loan.save

UPDATE "loans" SET "enddate" = ?, "updated_at" = ? WHERE "loans"."id" = ?  [["enddate", "2016-06-30"], ["updated_at", "2016-06-16 17:28:19.131212"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @loan.update(loan_params)

SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_loan
      @loan = Loan.find(params[:id])