app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "consumeall@gmail.com"]]
---
  def login
    user = User.find_by(name: params[:user][:name])

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def new
    User.create(name: params[:user][:name], password: params[:user][:password])