app/controllers/transactionlogger_controller.rb

SELECT "transactionloggers".* FROM "transactionloggers" WHERE "transactionloggers"."key" = ? AND (created_at > '2016-06-13 00:00:00.000000') AND (created_at < '2016-06-13 00:00:00.000000') GROUP BY users  [["key", "Loan amount"]]
SELECT "transactionloggers".* FROM "transactionloggers" WHERE "transactionloggers"."key" = ? AND (created_at > '2016-06-13 00:00:00.000000') AND (created_at < '2016-06-13 00:00:00.000000') GROUP BY "transactionloggers"."user"  [["key", "Loan amount"]]
---
  def report

    loans = []
    if params[:q] && params[:q][:key] then

      key = params[:q][:key]

         #eliminating the record id from the key if not only looking at repeated edits of the same record
      loans = Transactionlogger.where(key: key)


      if params[:q][:date_gt].present? then
        loans = loans.where("created_at > ?", params[:q][:date_gt].to_datetime)
      end
      if params[:q][:date_lt].present? then
        loans = loans.where("created_at < ?", params[:q][:date_lt].to_datetime)
      end

      if params[:q][:count] then
        threshold = params[:q][:count].to_i
        @flagged = []
        (params[:q][:same].present? && params[:q][:same] == 1) ? grouped = loans.group("user", "recordid") : grouped = loans.group("user")

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
      @flagged = []
    end
    for flag in @flagged
        flag[:email] = User.find(flag[:user].to_i).name